function CACode = GenCACode(SigNum, NumCycles)
%
% Функция генерирует заданное число периодов (циклов) C/A кода системы GPS,
% т.е. массив-строку длиной кратной 1023.
%
% SigNum    - номер кода, 1...63;
% NumCycles - количество периодов C/A кода по 1023 отсчёта (1...1000), по
%   умолчанию NumCycles = 1.
%
% CACode    - массив строка 1хNumCycles*1023, содержащая NumCycles периодов
%   C/A кода.
delay = [5;6;7;8;17;18;139;140;141;251;252;254;255;256;257;258;469;470;471;472;473;474;509;512;513;514;515;516;859;860;861;862;863;950;947;948;950;67;103;91;19;679;225;625;946;638;161;1001;554;280;710;709;775;864;558;220;397;55;898;759;367;299;1018];

G1 = M_seq_gen([0,0,1,0,0,0,0,0,0,1],[1,1,1,1,1,1,1,1,1,1]);
G2 = M_seq_gen([0,1,1,0,0,1,0,1,1,1],[1,1,1,1,1,1,1,1,1,1]);
G2_i = circshift(G2,delay(SigNum));
CACode_1period = mod((G1+G2_i),2);
CACode=[];
for i = 1:NumCycles
    CACode = [CACode,CACode_1period];
end


